Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДокументов</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МесяцНачисления = ОбщегоНазначения.ТекущаяДатаПользователя();
	УстановитьНовыйПериод(МесяцНачисления);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
 
&НаКлиенте
Процедура ПериодСтрокойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Оповещение = Новый ОписаниеОповещения("ПослеВводаДаты",ЭтотОбъект,Параметры);
	ПоказатьВводДаты(Оповещение,Объект.МесяцНачисления,"Введите новое значение даты", ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияСтрокойПриИзменении(Элемент)
	Объект.СписокДокументов.Очистить();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокумент(Команда)
	ДлительнаяОперация = НачатьСозданиеДокументов();

  ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
  Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияДокументов", ЭтотОбъект);
  ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте 
Процедура ПослеВводаДаты(НовДата, Параметры) Экспорт   
	Если НЕ НовДата = Неопределено Тогда
		УстановитьНовыйПериод(НовДата);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьНовыйПериод(ДатаП)
	Объект.МесяцНачисления = НачалоДня(ДатаП);
	МесяцНачисленияСтрокой = ДатуВСтроку(Объект.МесяцНачисления);
КонецПроцедуры

&НаСервере
Функция ДатуВСтроку(ДатаП)
	Рез = "";
	Рез = ""+Формат(Объект.МесяцНачисления, "ДФ='MMMM yyyy'");	 
	Возврат Рез;
КонецФункции

&НаСервере
Функция НачатьСозданиеДокументов()
	
  Объект.СписокДокументов.Очистить();
  ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
  Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументНаСервере", Объект.МесяцНачисления);

КонецФункции

&НаКлиенте
Процедура ПриЗавершенииСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт

  Если Результат = Неопределено Тогда // Пользователь отменил задание.
    Возврат;
  КонецЕсли;

  Если Результат.Статус = "Ошибка" Тогда
    ОбщегоНазначенияКлиент.СообщитьПользователю("Произошла ошибка");
    Возврат;
  КонецЕсли;
  ТаблДок = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
  УдалитьИзВременногоХранилища(Результат.АдресРезультата);
  ДобавитьСтрокиТЧ(ТаблДок);

КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокиТЧ(ТаблДок)
	МассивДоговоров = ТаблДок[0];
	МассивДокументов = ТаблДок[1];
	Для Индекс = 0 По МассивДоговоров.Количество() - 1 Цикл
	НоваяСтрока = Объект.СписокДокументов.Добавить();
    НоваяСтрока.Договор = МассивДоговоров[Индекс];
    НоваяСтрока.ДокументРеализации = МассивДокументов[Индекс];
    КонецЦикла;
КонецПроцедуры	 

#КонецОбласти
